codelingo/troubleshooting/tenets/orginterfaces.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-02 Fri 19:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>troubleshooting new tenet <code>orginterfaces</code></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shane" />
<link rel="stylesheet" type="text/css" href="https://mullikine.github.io/org-main.css"/>
<link rel="stylesheet" type="text/css" href="https://mullikine.github.io/magit.css"/>
</head>
<body>
<div id="content">
<h1 class="title">troubleshooting new tenet <code>orginterfaces</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org547fda9">1. Problem</a>
<ul>
<li><a href="#orga4030ef">1.1. <code>example files</code></a></li>
<li><a href="#org8998103">1.2. This <code>codelingo.yaml</code> fails</a></li>
<li><a href="#orgb27a691">1.3. repository info</a></li>
<li><a href="#org502c2be">1.4. repo state</a>
<ul>
<li><a href="#org72a10f9">1.4.1. <code>git status</code></a></li>
<li><a href="#orgcee7385">1.4.2. recent commits</a></li>
</ul>
</li>
<li><a href="#org55fa388">1.5. repo state</a>
<ul>
<li><a href="#org966be18">1.5.1. <code>git status</code></a></li>
<li><a href="#orgbe38569">1.5.2. recent commits</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org547fda9" class="outline-2">
<h2 id="org547fda9"><span class="section-number-2">1</span> Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
It appears as though when a second <code>go.file</code> fact is placed here in this tenet, the interface is not matched.
</p>
</div>

<div id="outline-container-orga4030ef" class="outline-3">
<h3 id="orga4030ef"><span class="section-number-3">1.1</span> <code>example files</code></h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">./bad-interface.go</span>
<span style="color: #a1db00;">package</span> main

<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"fmt"</span>
<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"math"</span>

<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">This should live in `interface.go`</span>
<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">badlyPlacedGeometry</span> <span style="color: #a1db00;">interface</span> {
      <span style="color: #ffd700;">area</span>() float64
      <span style="color: #ffd700;">perim</span>() float64
}

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">rect</span> <span style="color: #a1db00;">struct</span> {
      width, height float64
}
<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">circle</span> <span style="color: #a1db00;">struct</span> {
      radius float64
}

<span style="color: #a1db00;">func</span> (r <span style="color: #00d7af;">rect</span>) <span style="color: #ffd700;">area</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> r.width * r.height
}
<span style="color: #a1db00;">func</span> (r <span style="color: #00d7af;">rect</span>) <span style="color: #ffd700;">perim</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> 2*r.width + 2*r.height
}

<span style="color: #a1db00;">func</span> (c <span style="color: #00d7af;">circle</span>) <span style="color: #ffd700;">area</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> math.Pi * c.radius * c.radius
}
<span style="color: #a1db00;">func</span> (c <span style="color: #00d7af;">circle</span>) <span style="color: #ffd700;">perim</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> 2 * math.Pi * c.radius
}

<span style="color: #a1db00;">func</span> <span style="color: #ffd700;">measure</span>(g <span style="color: #00d7af;">badlyPlacedGeometry</span>) {
      fmt.<span style="color: #ffd700;">Println</span>(g)
      fmt.<span style="color: #ffd700;">Println</span>(g.<span style="color: #ffd700;">area</span>())
      fmt.<span style="color: #ffd700;">Println</span>(g.<span style="color: #ffd700;">perim</span>())
}

<span style="color: #a1db00;">func</span> <span style="color: #ffd700;">main</span>() {
      r := <span style="color: #00d7af;">rect</span>{width: 3, height: 4}
      c := <span style="color: #00d7af;">circle</span>{radius: 5}

      <span style="color: #ffd700;">measure</span>(r)
      <span style="color: #ffd700;">measure</span>(c)
}

<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">./interface.go</span>
<span style="color: #a1db00;">package</span> main

<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"fmt"</span>
<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"math"</span>

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">wellPlacedGeometry</span> <span style="color: #a1db00;">interface</span> {
      <span style="color: #ffd700;">area</span>() float64
      <span style="color: #ffd700;">perim</span>() float64
}

<span style="color: #a1db00;">func</span> <span style="color: #ffd700;">measureFoo</span>(g <span style="color: #00d7af;">wellPlacedGeometry</span>) {
      fmt.<span style="color: #ffd700;">Println</span>(g)
      fmt.<span style="color: #ffd700;">Println</span>(g.<span style="color: #ffd700;">area</span>())
      fmt.<span style="color: #ffd700;">Println</span>(g.<span style="color: #ffd700;">perim</span>())
}

<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">./example/bad-interface-2.go</span>
<span style="color: #a1db00;">package</span> main

<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"fmt"</span>
<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"math"</span>

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">badGeometry</span> <span style="color: #a1db00;">interface</span> {
      <span style="color: #ffd700;">badArea</span>() float64
      <span style="color: #ffd700;">badPerim</span>() float64
}

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">badRect</span> <span style="color: #a1db00;">struct</span> {
      width, height float64
}
<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">badCircle</span> <span style="color: #a1db00;">struct</span> {
      radius float64
}

<span style="color: #a1db00;">func</span> (r <span style="color: #00d7af;">badRect</span>) <span style="color: #ffd700;">badArea</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> r.width * r.height
}
<span style="color: #a1db00;">func</span> (r <span style="color: #00d7af;">badRect</span>) <span style="color: #ffd700;">badPerim</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> 2*r.width + 2*r.height
}

<span style="color: #a1db00;">func</span> (c <span style="color: #00d7af;">badCircle</span>) <span style="color: #ffd700;">badArea</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> math.Pi * c.radius * c.radius
}
<span style="color: #a1db00;">func</span> (c <span style="color: #00d7af;">badCircle</span>) <span style="color: #ffd700;">badPerim</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> 2 * math.Pi * c.radius
}

<span style="color: #a1db00;">func</span> <span style="color: #ffd700;">badMeasure</span>(g <span style="color: #00d7af;">badGeometry</span>) {
      fmt.<span style="color: #ffd700;">Println</span>(g)
      fmt.<span style="color: #ffd700;">Println</span>(g.<span style="color: #ffd700;">badArea</span>())
      fmt.<span style="color: #ffd700;">Println</span>(g.<span style="color: #ffd700;">badPerim</span>())
}


<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">./example/interface.go</span>
<span style="color: #a1db00;">package</span> main

<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"fmt"</span>
<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"math"</span>

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">goodGeometry</span> <span style="color: #a1db00;">interface</span> {
      <span style="color: #ffd700;">goodArea</span>() float64
      <span style="color: #ffd700;">goodPerim</span>() float64
}

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">goodRect</span> <span style="color: #a1db00;">struct</span> {
      width, height float64
}
<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">goodCircle</span> <span style="color: #a1db00;">struct</span> {
      radius float64
}

<span style="color: #a1db00;">func</span> (r <span style="color: #00d7af;">goodRect</span>) <span style="color: #ffd700;">goodArea</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> r.width * r.height
}
<span style="color: #a1db00;">func</span> (r <span style="color: #00d7af;">goodRect</span>) <span style="color: #ffd700;">goodPerim</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> 2*r.width + 2*r.height
}

<span style="color: #a1db00;">func</span> (c <span style="color: #00d7af;">goodCircle</span>) <span style="color: #ffd700;">goodArea</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> math.Pi * c.radius * c.radius
}
<span style="color: #a1db00;">func</span> (c <span style="color: #00d7af;">goodCircle</span>) <span style="color: #ffd700;">goodPerim</span>() <span style="color: #00d7af;">float64</span> {
      <span style="color: #a1db00;">return</span> 2 * math.Pi * c.radius
}

<span style="color: #a1db00;">func</span> <span style="color: #ffd700;">goodMeasure</span>(g <span style="color: #00d7af;">goodGeometry</span>) {
      fmt.<span style="color: #ffd700;">Println</span>(g)
      fmt.<span style="color: #ffd700;">Println</span>(g.<span style="color: #ffd700;">goodArea</span>())
      fmt.<span style="color: #ffd700;">Println</span>(g.<span style="color: #ffd700;">goodPerim</span>())
}

<span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">func main() {</span>
<span style="color: #6c6c6c; font-style: italic;">//      </span><span style="color: #6c6c6c; font-style: italic;">r := goodRect{width: 3, height: 4}</span>
<span style="color: #6c6c6c; font-style: italic;">//      </span><span style="color: #6c6c6c; font-style: italic;">c := goodCircle{radius: 5}</span>
<span style="color: #6c6c6c; font-style: italic;">//</span>
<span style="color: #6c6c6c; font-style: italic;">//      </span><span style="color: #6c6c6c; font-style: italic;">goodMeasure(r)</span>
<span style="color: #6c6c6c; font-style: italic;">//      </span><span style="color: #6c6c6c; font-style: italic;">goodMeasure(c)</span>
<span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org8998103" class="outline-3">
<h3 id="org8998103"><span class="section-number-3">1.2</span> This <code>codelingo.yaml</code> fails</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #ff8700;">funcs</span>:
- <span style="color: #ff8700;">name</span>: isNotInterfaceFile
  <span style="color: #ff8700;">type</span>: asserter
  <span style="color: #ff8700;">body</span>: |
    <span style="color: #ff4ea3;">function (str) {</span>
<span style="color: #ff4ea3;">      return ! str.match(/(^|\/)interface.go$/);</span>
<span style="color: #ff4ea3;">    }</span>
- name: isInterfaceFile
  <span style="color: #ff8700;">type</span>: asserter
  <span style="color: #ff8700;">body</span>: |
    <span style="color: #ff4ea3;">function (str) {</span>
<span style="color: #ff4ea3;">      return str.match(/(^|\/)interface.go$/);</span>
<span style="color: #ff4ea3;">    }</span>
tenets:
  - <span style="color: #ff8700;">name</span>: orginterfaces
    <span style="color: #ff8700;">flows</span>:
      <span style="color: #ff8700;">codelingo/docs</span>:
        <span style="color: #ff8700;">title</span>: Interface Not In The Interface File
        <span style="color: #ff8700;">body</span>: Finds interfaces which are not defined in `interface.go`.
      <span style="color: #ff8700;">codelingo/review</span>:
        <span style="color: #ff8700;">comment</span>: Interface `{{iname}}` is defined in a file named `{{fnamebad}}`. There exists, however, a file named `{{fnameinterfacego}}` in same directory. Interfaces should be defined in the `interface.go` of the relevant folder.
      <span style="color: #ff8700;">codelingo/rewrite</span>:
    <span style="color: #ff8700;">query</span>: |
      <span style="color: #ff4ea3;">import codelingo/ast/go</span>

<span style="color: #ff4ea3;">      go.dir:</span>
<span style="color: #ff4ea3;">        go.file:</span>
<span style="color: #ff4ea3;">          filename as fnamebad</span>

<span style="color: #ff4ea3;">          @rewrite --cut src</span>
<span style="color: #ff4ea3;">          @review comment</span>
<span style="color: #ff4ea3;">          go.type_spec(depth = any):</span>
<span style="color: #ff4ea3;">            go.ident:</span>
<span style="color: #ff4ea3;">              name as iname</span>
<span style="color: #ff4ea3;">            go.interface_type</span>

<span style="color: #ff4ea3;">        @rewrite --append --line src</span>
<span style="color: #ff4ea3;">        go.file:</span>
<span style="color: #ff4ea3;">          filename as fnameinterfacego</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb27a691" class="outline-3">
<h3 id="orgb27a691"><span class="section-number-3">1.3</span> repository info</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">tenet source</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/mullikine/tenets/blob/master/blog/orginterfaces">tenets/blog/orginterfaces at master  mullikine/tenets  GitHub</a></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">org</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/orginterfaces.org">github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/orginterfaces.org</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org502c2be" class="outline-3">
<h3 id="org502c2be"><span class="section-number-3">1.4</span> repo state</h3>
<div class="outline-text-3" id="text-1-4">
<dl class="org-dl">
<dt>url</dt><dd><a href="https://github.com/codelingo/codelingo/blob/master">https://github.com/codelingo/codelingo/blob/master</a></dd>
</dl>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cat /etc/issue</td>
<td class="org-left">Ubuntu 16.04.4 LTS \n \l</td>
</tr>

<tr>
<td class="org-left">vc url</td>
<td class="org-left"><a href="https://github.com/codelingo/codelingo">https://github.com/codelingo/codelingo</a></td>
</tr>

<tr>
<td class="org-left">vc get-hash</td>
<td class="org-left">eae3300ad7c32994725f90344f7cc25edfee6eca</td>
</tr>

<tr>
<td class="org-left">vc branch</td>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">go version</td>
<td class="org-left">go version go1.11.1 linux/amd64</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org72a10f9" class="outline-4">
<h4 id="org72a10f9"><span class="section-number-4">1.4.1</span> <code>git status</code></h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>Verify that there are no unstaged changes here.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcee7385" class="outline-4">
<h4 id="orgcee7385"><span class="section-number-4">1.4.2</span> recent commits</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-text">commit eae3300ad7c32994725f90344f7cc25edfee6eca
Author: Jesse Meek <a href="mailto:waigani%40gmail.com">&lt;waigani@gmail.com&gt;</a>

    Disable test Tenet until mem spike is fixed.
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org55fa388" class="outline-3">
<h3 id="org55fa388"><span class="section-number-3">1.5</span> repo state</h3>
<div class="outline-text-3" id="text-1-5">
<dl class="org-dl">
<dt>url</dt><dd>git@github.com:mullikine/lingo.git/blob/master</dd>
</dl>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cat /etc/issue</td>
<td class="org-left">Ubuntu 16.04.4 LTS \n \l</td>
</tr>

<tr>
<td class="org-left">vc url</td>
<td class="org-left">git@github.com:mullikine/lingo.git</td>
</tr>

<tr>
<td class="org-left">vc get-hash</td>
<td class="org-left">fc18bb8b8a83c483aa58606f0695de1e1cd55f1b</td>
</tr>

<tr>
<td class="org-left">vc branch</td>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">go version</td>
<td class="org-left">go version go1.11.1 linux/amd64</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org966be18" class="outline-4">
<h4 id="org966be18"><span class="section-number-4">1.5.1</span> <code>git status</code></h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Verify that there are no unstaged changes here.</li>
</ul>
<div class="org-src-container">
<pre class="src src-text">On branch master
Your branch is ahead of 'origin/master' by 47 commits.
  (use "git push" to publish your local commits)

Changes not staged for commit:
  (use "git add &lt;file&gt;..." to update what will be committed)
  (use "git checkout -- &lt;file&gt;..." to discard changes in working directory)

      modified:   Gopkg.lock

no changes added to commit (use "git add" and/or "git commit -a")
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe38569" class="outline-4">
<h4 id="orgbe38569"><span class="section-number-4">1.5.2</span> recent commits</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">
<pre class="src src-text">commit fc18bb8b8a83c483aa58606f0695de1e1cd55f1b
Merge: ca7671c 191b3c4
Author: BlakeMScurr <a href="mailto:blake%40codelingo.io">&lt;blake@codelingo.io&gt;</a>

    Merge pull request #431 from BlakeMScurr/insecure 
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shane</p>
<p class="date">Created: 2018-11-02 Fri 19:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>